In [1]:
#online free docs:          https://pandas.pydata.org/pandas-docs/stable/,
#                  https://docs.scipy.org/doc/numpy/reference/ufuncs.html#available-ufuncs,
#                  https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-stats,
#                  https://pandas.pydata.org/pandas-docs/stable/api.html#api-series-stats,
#                  https://pandas.pydata.org/pandas-docs/stable/api.html#api-dataframe-stats,
# book old edition free:  https://www.safaribooksonline.com/library/view/python-data-science/9781491912126",
# book new edition pay: https://smile.amazon.com/Python-Data-Science-Handbook-Essential/dp/1491912057/"

In [2]:
import numpy as np 
import pandas as pd

In [3]:
####universal functions (or ufuncs)#####
# https://docs.scipy.org/doc/numpy/reference/ufuncs.html#available-ufuncs,
# pandas inherits much of this functionality from NumPy.,
# so can pretty much use all the ufuncs we learend about with NumPy

In [4]:
#create Dataframe 3x5 with random Integers

In [7]:
df = pd.DataFrame(np.random.randn(3,5),index=['X','Y','Z'],columns=['a','b','c','d','e'])

In [8]:
df

          a         b         c         d         e
X -0.557665 -0.122154  0.233143 -1.012747  1.061987
Y  0.632632 -0.406900  2.355941  0.269717  0.332179
Z -0.519962  0.049297  0.436980 -1.186367 -0.805206

In [ ]:
#Calculate the exponential of all elements in the input array.
# Check the following before attempting to implement any standard math function 
# https://numpy.org/doc/stable/reference/ufuncs.html#available-ufuncs

In [9]:
np.exp(df)

          a         b          c         d         e
X  0.572544  0.885012   1.262562  0.363220  2.892113
Y  1.882559  0.665711  10.548051  1.309594  1.394003
Z  0.594543  1.050532   1.548025  0.305328  0.446996

In [10]:
np.sin(df*np.pi/4)

          a         b         c         d         e
X -0.424119 -0.095793  0.182089 -0.714150  0.740681
Y  0.476674 -0.314167  0.961178  0.210255  0.257944
Z -0.397121  0.038708  0.336505 -0.802677 -0.591088

In [11]:
df = pd.DataFrame(np.ones((3,5)),index=['X','Y','Z'],columns=['a','b','c','d','e'])

In [12]:
df

     a    b    c    d    e
X  1.0  1.0  1.0  1.0  1.0
Y  1.0  1.0  1.0  1.0  1.0
Z  1.0  1.0  1.0  1.0  1.0

In [14]:
-df

     a    b    c    d    e
X -1.0 -1.0 -1.0 -1.0 -1.0
Y -1.0 -1.0 -1.0 -1.0 -1.0
Z -1.0 -1.0 -1.0 -1.0 -1.0

In [15]:
df*10

      a     b     c     d     e
X  10.0  10.0  10.0  10.0  10.0
Y  10.0  10.0  10.0  10.0  10.0
Z  10.0  10.0  10.0  10.0  10.0

In [16]:
#scaler manipulation for each element in the DataFrame

In [18]:
ser1 = pd.Series(data=[10,20,30],index=['a','b','c'])
ser2 = pd.Series(data=[100,200,300],index=['a','b','c'])

In [21]:
ser1

a    10
b    20
c    30
dtype: int64

In [20]:
ser2

a    100
b    200
c    300
dtype: int64

In [22]:
ser1+ ser2

a    110
b    220
c    330
dtype: int64

In [ ]:
#misaligned value: produce NaN

In [24]:
ser1 = pd.Series(np.random.randint(-10,10,5),index=['a','b','c','d','e'])
ser2 = pd.Series(np.random.randint(-15,15,5),index=['c','d','e','f','g'])

In [25]:
ser1

a   -7
b   -8
c    3
d   -7
e   -8
dtype: int64

In [26]:
ser2

c     4
d     9
e     9
f    -2
g   -15
dtype: int64

In [27]:
ser1 + ser2

a    NaN
b    NaN
c    7.0
d    2.0
e    1.0
f    NaN
g    NaN
dtype: float64

In [28]:
df1 = pd.DataFrame(data=[[1,2,3,4],[5,6,7,8]],index=['X','Y'],columns=['a','b','c','d'])
df2 = pd.DataFrame(data=[[10,20,30,40],[50,60,70,80]],index=['X','Y'],columns=['a','b','c','d'])

In [29]:
df1

   a  b  c  d
X  1  2  3  4
Y  5  6  7  8

In [30]:
df2

    a   b   c   d
X  10  20  30  40
Y  50  60  70  80

In [31]:
df1 + df2

    a   b   c   d
X  11  22  33  44
Y  55  66  77  88

In [45]:
#misaligned value DataFrame

In [41]:
df1 = pd.DataFrame(np.random.randint(-10,10,(3,5)),index = ['X','Y','Z'],columns=['a','b','c','d','e'])
df2 = pd.DataFrame(np.random.randint(-15,15,(3,5)),index = ['X','Y','W'],columns=['c','d','e','f','g'])

In [42]:
df1

   a  b  c  d  e
X -5 -8  4  7  8
Y -2 -9 -3 -9  1
Z  8  2 -9 -2 -3

In [43]:
df2

    c   d   e   f   g
X  -8 -14  14 -11 -14
Y  -4   1  14 -14  10
W -11  -9   6  -8  14

In [44]:
df1 + df2

    a   b    c    d     e   f   g
W NaN NaN  NaN  NaN   NaN NaN NaN
X NaN NaN -4.0 -7.0  22.0 NaN NaN
Y NaN NaN -7.0 -8.0  15.0 NaN NaN
Z NaN NaN  NaN  NaN   NaN NaN NaN

In [46]:
df1 = pd.DataFrame(np.random.randint(-10,10,(3,5)),index = ['X','Y','Z'],columns=['a','b','c','d','e'])
df2 = pd.DataFrame(np.random.randint(-15,15,(1,5)),index = ['X'],columns=['c','d','e','f','g'])

In [47]:
df1

   a  b  c  d  e
X  5 -5  9  2  3
Y  1  4  9  6  4
Z  0 -9  0 -3  8

In [48]:
df2

   c   d   e   f  g
X  2 -13  12  11  1

In [49]:
df1 + df2

    a   b     c     d     e   f   g
X NaN NaN  11.0 -11.0  15.0 NaN NaN
Y NaN NaN   NaN   NaN   NaN NaN NaN
Z NaN NaN   NaN   NaN   NaN NaN NaN

In [51]:
df1 = pd.DataFrame(np.random.randint(-10,10,(3,5)),index = ['X','Y','Z'],columns=['a','b','c','d','e'])
df2 = pd.DataFrame(np.random.randint(-15,15,(3,1)),index = ['X','Y','Z'],columns=['c'])

In [52]:
df1

    a  b  c   d  e
X -10 -9  5  -2 -8
Y   9  7 -3  -6 -4
Z   8 -3  9 -10 -8

In [53]:
df2

   c
X -9
Y -2
Z  5

In [54]:
df1 + df2

    a   b   c   d   e
X NaN NaN  -4 NaN NaN
Y NaN NaN  -5 NaN NaN
Z NaN NaN  14 NaN NaN

In [1]:
##### aggregations #####\n",
# count, sum, mean, median, mode, min, max, std, var, quantile, etc,
# https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-stats,
# https://pandas.pydata.org/pandas-docs/stable/api.html#api-series-stats,
# https://pandas.pydata.org/pandas-docs/stable/api.html#api-dataframe-stats"

In [ ]:
# define DF 3X5 random numbers

In [9]:
np.random.seed(0)
df = pd.DataFrame(np.random.randn(3,5),index=['X','Y','Z'],columns=['a','b','c','d','e'])
df

          a         b         c         d         e
X  1.764052  0.400157  0.978738  2.240893  1.867558
Y -0.977278  0.950088 -0.151357 -0.103219  0.410599
Z  0.144044  1.454274  0.761038  0.121675  0.443863

In [10]:
#provide descriptive stats on df by column

In [11]:
df.describe()

              a         b         c         d         e
count  3.000000  3.000000  3.000000  3.000000  3.000000
mean   0.310273  0.934840  0.529473  0.753116  0.907340
std    1.378204  0.527224  0.599579  1.293350  0.831740
min   -0.977278  0.400157 -0.151357 -0.103219  0.410599
25%   -0.416617  0.675123  0.304840  0.009228  0.427231
50%    0.144044  0.950088  0.761038  0.121675  0.443863
75%    0.954048  1.202181  0.869888  1.181284  1.155711
max    1.764052  1.454274  0.978738  2.240893  1.867558

In [12]:
#

In [13]:
df.count(axis=0) # the aggregation for each coulmn

a    3
b    3
c    3
d    3
e    3
dtype: int64

In [14]:
df.sum(axis=1) # the aggregation for each row

X    7.251399
Y    0.128833
Z    2.924893
dtype: float64

In [15]:
#maybe able to determine which aggr needed based on the label(s)

In [16]:
df['a'].median() #median for a specific column of data

0.144043571160878

In [18]:
df.loc['X'].mean() # mean for a specific row of data

1.4502797455584104

In [ ]:
#Determine correlation between two columns

In [19]:
df[['a','b']].corr()

          a         b
a  1.000000 -0.607805
b -0.607805  1.000000

In [ ]:
#unique counts/frequencies

In [20]:
df = pd.DataFrame([[10,20,3,4,5],
                   [10,20,30,40,50],
                   [10,21,31,40,50,],
                   [100,20,100,100,500]],
                  index=list('XYZW'),
                  columns=list('ABCDE'))
df

     A   B    C    D    E
X   10  20    3    4    5
Y   10  20   30   40   50
Z   10  21   31   40   50
W  100  20  100  100  500

In [24]:
df['A'].unique() #display unique values in column 'A'

array([ 10, 100])

In [25]:
df['A'].nunique() #number of unique values in the column

2

In [ ]:
#Super useful for text data!!!

In [26]:
df['A'].value_counts()

10     3
100    1
Name: A, dtype: int64

In [28]:
df = pd.DataFrame([[10,20,3,4,'abc'],
                   [10,20,30,40,'abcd'],
                   [10,21,31,40,'abcde'],
                   [100,20,100,100,'abcdef']],
                  index=list('XYZW'),
                  columns=list('ABCDE'))
df

     A   B    C    D       E
X   10  20    3    4     abc
Y   10  20   30   40    abcd
Z   10  21   31   40   abcde
W  100  20  100  100  abcdef

In [ ]:
#use apply in conjuction with lambda

In [ ]:
#useful for transforming your data

In [29]:
#take every value and square it

In [32]:
df['A'].apply(lambda x: x**2)

X      100
Y      100
Z      100
W    10000
Name: A, dtype: int64

In [33]:
df['E'].apply(len)

X    3
Y    4
Z    5
W    6
Name: E, dtype: int64

In [36]:
df = pd.DataFrame([[11,20,3,4,5],
                   [101,20,30,40,50],
                   [99,21,31,40,50,],
                   [10,20,100,100,500]],
                  index=list('XYZW'),
                  columns=list('ABCDE'))
df

     A   B    C    D    E
X   11  20    3    4    5
Y  101  20   30   40   50
Z   99  21   31   40   50
W   10  20  100  100  500

In [38]:
#column sort like in excel

df.sort_values(by='A')

     A   B    C    D    E
W   10  20  100  100  500
X   11  20    3    4    5
Z   99  21   31   40   50
Y  101  20   30   40   50

In [39]:
###Vectorized string operations on DataFrames

In [ ]:
# review regualr expressions!

In [41]:
ser = pd.Series(['Graham Chapman','John Cleese','Terry Gilliam','Michael Palin',np.nan])
ser

0    Graham Chapman
1       John Cleese
2     Terry Gilliam
3     Michael Palin
4               NaN
dtype: object

In [43]:
ser.str.lower()

0    graham chapman
1       john cleese
2     terry gilliam
3     michael palin
4               NaN
dtype: object

In [44]:
ser.str.len()

0    14.0
1    11.0
2    13.0
3    13.0
4     NaN
dtype: float64

In [45]:
ser

0    Graham Chapman
1       John Cleese
2     Terry Gilliam
3     Michael Palin
4               NaN
dtype: object

In [46]:
# regular expression methods (calls underlying re. methods),
# match(), extract(), findall(), replace(), contains(), count(), split(), rsplit()

In [ ]:
#extract the first word that has all letters in it (in a continous form)
# once you hit a space the condition no longer holds and returns the first word

In [47]:
ser.str.extract('([A-Za-z]+)')

         0
0   Graham
1     John
2    Terry
3  Michael
4      NaN

In [48]:
ser.str.split().str.get(-1)

0    Chapman
1     Cleese
2    Gilliam
3      Palin
4        NaN
dtype: object

In [50]:
# regular expression methods (calls underlying re. methods)",
# match(), extract(), findall(), replace(), contains(), count(), split(), rsplit()

In [49]:
# string methods,
# len(), ljust(), rjust(), center(), zfill(), strip(), rstrip(), lstrip()",
# lower(), upper(), find(), rfind(), index(), rindex(), capitalize(), swapcase()",
# translate(), startswith(), endswith(), isalnum(), isalpha(), isdigit(), isspace(), istitle()",
# islower(), isupper(), isnumeric(), isdecimal(), split(), rsplit(), partition(), rpartition()

In [ ]:
# Miscellaneous Methods
# get(), slice(), slice_replace(), cat(), repeat(), normalize(), pad(), wrap(), join(), get_dummies()